app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]
---
  def comments
    @comments = Post.find(params[:id]).comments

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "upvotes" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["upvotes", 1], ["updated_at", 2017-03-01 00:09:47 UTC], ["id", 2]]
---
  def upvote
    @post = Post.find(params[:id])
    @post.upvotes += 1
    @post.save