app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at", "api_token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "name"], ["email", "email@email.com"], ["created_at", 2017-03-01 04:17:08 UTC], ["updated_at", 2017-03-01 04:17:08 UTC], ["api_token", "BRrRPH87kN21ViGGSkhH8mpQ"]]