app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "bio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "user"], ["email", "email@email.com"], ["bio", "bio"], ["created_at", 2017-03-01 00:53:41 UTC], ["updated_at", 2017-03-01 00:53:41 UTC]]

  def posts
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 101], ["LIMIT", 1]]